Repository: jvarejao/NAVIGEST
Catalog: src/NAVIGEST.Shared/Resources/Strings/AppResources.*.resx
Languages: pt

# ClientsPage_Title
source: Clients
pt: Clientes

# ClientsPage_NewClient
source: New Client
pt: Novo Cliente

# ClientsPage_AddClient
source: Add Client
pt: Adicionar Cliente

# ClientsPage_EditClient
source: Edit {0}
pt: Editar {0}

# Common_Save
source: Save
pt: Guardar

# Common_Update
source: Update
pt: Atualizar

# Common_Cancel
source: Cancel
pt: Cancelar

# Common_Delete
source: Delete
pt: Eliminar

# Common_SearchPlaceholder
source: Search (code, name, email...)
pt: Pesquisar (código, nome, email...)

# Common_Name
source: Name
pt: Nome

# Common_Code
source: Code
pt: Código

# Common_Phone
source: Phone
pt: Telefone

# ClientsPage_External
source: EXTERNAL
pt: EXTERNO

# ClientsPage_Cancelled
source: CANCELLED
pt: ANULADO

# ClientsPage_Salesperson
source: Salesperson
pt: Vendedor

# ClientsPage_ClientNamePlaceholder
source: Client Name
pt: Nome do Cliente

# ClientsPage_CreditValue
source: Credit Value
pt: Valor Crédito

# ClientsPage_ExternalLabel
source: External
pt: Externo

# ClientsPage_CancelledLabel
source: Cancelled
pt: Anulado

# ClientsPage_SyncedFolders
source: Synced Folders
pt: Pastas Sincronizadas

# ProductsPage_Title
source: Products
pt: Produtos

# ProductsPage_NewProduct
source: New Product
pt: Novo Produto

# ProductsPage_SearchPlaceholder
source: Search (code, description, family...)
pt: Pesquisar (código, descrição, família...)

# Common_Cost
source: Cost
pt: Custo

# Common_Sale
source: Sale
pt: Venda

# Common_TotalSales
source: Total Sales
pt: Total Vendas

# Common_Collaborator
source: Collaborator
pt: Colaborador

# Common_Description
source: Description
pt: Descrição

# Common_Family
source: Family
pt: Família

# Common_Close
source: Close
pt: Fechar

# Common_Search
source: Search...
pt: Pesquisar...

# ProductsPage_CostPrice
source: Cost Price (€)
pt: Preço Custo (€)

# ProductsPage_SalePrice
source: Sale Price (€)
pt: Preço Venda (€)

# ProductsPage_ProductDescriptionPlaceholder
source: Product Description
pt: Descrição do Produto

# ProductsPage_SelectFamily
source: Select Family
pt: Selecionar família

# ProductsPage_AddFamily
source: Add Family
pt: Adicionar família

# ProductsPage_NewFamily
source: New Family
pt: Nova Família

# ProductsPage_FamilyCodePlaceholder
source: Family Code
pt: Código família

# ProductsPage_FamilyDescriptionPlaceholder
source: Family Description
pt: Descrição família

# Login_Title
source: Login
pt: Entrar

# Login_Welcome
source: Welcome 👋
pt: Bem-vindo 👋

# Login_UserFound
source: User found
pt: Utilizador encontrado

# Login_Subtitle
source: Sign in to continue
pt: Inicia sessão para continuar

# Login_PasswordPlaceholder
source: Password
pt: Palavra-passe

# Login_Button
source: Login
pt: Entrar

# Login_Biometric
source: Login with Face ID
pt: Entrar com Face ID

# Login_Config
source: Configure Connection
pt: Configurar Ligação

# Login_UsernamePlaceholder
source: Username
pt: Utilizador

# Login_RememberMe
source: Remember me on this device
pt: Lembrar-me neste dispositivo

# Common_Back
source: Back
pt: Voltar

# Login_ForgotPassword
source: Forgot password (email)
pt: Esqueci-me da palavra-passe (e-mail)

# Login_HaveCode
source: I have an email code
pt: Tenho um código do e-mail

# Login_InternalReset
source: Internal reset (admin)
pt: Reset interno (admin)

# Login_UseBiometric
source: Use biometrics (Face ID/Touch ID)
pt: Usar biometria (Face ID/Touch ID)

# Welcome_Connecting
source: Connecting to database...
pt: A ligar à base de dados…

# Welcome_Subtitle
source: Welcome to YAHPUBLICIDADE
pt: Bem-vindo à YAHPUBLICIDADE

# Welcome_Description
source: Start managing your data simply and modernly.
pt: Comece agora a gerir os seus dados de forma simples e moderna.

# Welcome_ConnectionFailed
source: Connection failed: {0}
pt: Ligação falhou: {0}

# Welcome_ConnectionError
source: Could not connect. Opening configuration...
pt: Não foi possível ligar. A abrir configuração…

# Welcome_Title
source: Welcome
pt: Bem-vindo

# Welcome_ChooseCompany
source: Choose company
pt: Escolhe a empresa

# Main_Logout
source: Logout
pt: Sair

# Main_Clients
source: Clients
pt: Clientes

# Main_Products
source: Products
pt: Produtos

# Main_Hours
source: Hours
pt: Horas

# Main_Services
source: Services
pt: Serviços

# Main_Theme
source: Theme
pt: Tema

# Main_ThemeAuto
source: Automatic
pt: Automático

# Main_ThemeLight
source: Light
pt: Claro

# Main_ThemeDark
source: Dark
pt: Escuro

# Main_WelcomeTo
source: Welcome to
pt: Bem-vindo à

# Main_AdminAccess
source: Admin Access
pt: Acesso Administrador

# Main_AdminUserPlaceholder
source: Username
pt: Utilizador

# Main_AdminPassPlaceholder
source: Password
pt: Palavra-passe

# Main_LogoutTitle
source: Logout
pt: Terminar Sessão

# Main_LogoutMessage
source: Are you sure you want to exit?
pt: Tem a certeza que deseja sair da aplicação?

# Main_LogoutConfirm
source: Exit
pt: Sair

# Main_CloseTitle
source: Close
pt: Fechar

# Main_CloseMessage
source: On Android/iOS we don't close the app directly.
pt: No Android/iOS não fechamos a app diretamente.

# Main_AccessDenied
source: Access denied
pt: Acesso negado

# Main_AdminRequired
source: ADMIN privileges required.
pt: Precisa de privilégios ADMIN.

# Main_AdminEnterCredentials
source: Enter username and password.
pt: Indica utilizador e palavra-passe.

# Login_InvalidCredentials
source: Invalid credentials.
pt: Credenciais inválidas.

# Main_NoContent
source: {0} has no content.
pt: {0} sem conteúdo.

# Settings_Title
source: Settings
pt: Definições

# Settings_SystemSettings
source: System Settings
pt: Definições do Sistema

# Settings_Users
source: Users
pt: Utilizadores

# Settings_UsersDesc
source: Manage accounts and permissions
pt: Gerir contas e permissões

# Settings_Database
source: Database
pt: Base de Dados

# Settings_DatabaseDesc
source: MariaDB / MySQL Connection
pt: Ligação MariaDB / MySQL

# Settings_FileServer
source: File Server
pt: Servidor Ficheiros

# Settings_FileServerDesc
source: Paths and Folders (NAS)
pt: Caminhos e Pastas (NAS)

# Settings_Language
source: Language
pt: Idioma

# Settings_LanguageDesc
source: Change Language
pt: Alterar Idioma / Language

# Common_Open
source: Open
pt: Abrir

# Common_Share
source: Share
pt: Partilhar

# Common_Copied
source: Copied
pt: Copiado

# Common_DetailsCopied
source: Details copied to clipboard.
pt: Detalhes copiados para a área de transferência.

# Common_Details
source: Details
pt: Detalhes

# ProductsPage_EditFamily
source: Edit Family
pt: Editar Família

# ProductsPage_FamilyDescriptionRequired
source: Description required.
pt: Descrição obrigatória.

# ProductsPage_FamilySaveError
source: Could not save family.
pt: Não foi possível guardar a família.

# ProductsPage_FamilyUpdated
source: Family updated.
pt: Família atualizada.

# ProductsPage_FamilyDeleteError
source: Could not delete family.
pt: Não foi possível eliminar a família.

# ProductsPage_FamilyDeleted
source: Family deleted.
pt: Família eliminada.

# ProductsPage_FamilyCodeRequired
source: Code required.
pt: Código obrigatório.

# ProductsPage_FamilyCreated
source: Family created successfully.
pt: Família criada com sucesso.

# ClientsPage_SalespersonFormError
source: Error preparing salesperson form.
pt: Erro ao preparar o formulário de vendedor.

# ClientsPage_SalespersonNameRequired
source: Enter salesperson name.
pt: Introduza o nome do vendedor.

# ClientsPage_SalespersonSaveError
source: Error saving salesperson.
pt: Erro ao guardar o vendedor.

# ClientsPage_SalespersonLoadError
source: Error loading salespersons.
pt: Erro ao carregar vendedores.

# ProductsPage_FamilyFormError
source: Error preparing family form.
pt: Erro ao preparar o formulário de família.

# ProductsPage_FamilyFillRequired
source: Fill in code and description.
pt: Preencha código e descrição.

# ProductsPage_FamilyLoadError
source: Error loading families.
pt: Erro ao carregar famílias.

# Hours_ErrorInvalidNormalHours
source: Enter valid normal hours (0-24).
pt: Insira horas normais válidas (0-24).

# Hours_ErrorInvalidExtraHours
source: Enter valid extra hours (0-24).
pt: Insira horas extras válidas (0-24).

# Hours_ErrorTotalHoursExceeded
source: Total hours cannot exceed 24h.
pt: Total de horas não pode exceder 24h.

# Common_Success
source: Success
pt: Sucesso

# Pdf_FolderCreatedButNotFound
source: Folder created but not found: {0}
pt: Pasta criada mas não encontrada: {0}

# Pdf_FileExists
source: File Exists
pt: Ficheiro Existente

# Pdf_FileExistsMessage
source: A file with this name already exists. Overwrite?
pt: Já existe um ficheiro com este nome. Substituir?

# Pdf_SavedSuccess
source: PDF saved to: {0}
pt: PDF guardado em: {0}

# Pdf_GenerationError
source: Could not generate PDF.
pt: Não foi possível gerar o PDF.

# Pdf_SaveError
source: Error saving PDF: {0}
pt: Erro ao guardar PDF: {0}

# Pdf_ShareTitle
source: Share PDF
pt: Partilhar PDF

# Pdf_ShareError
source: Error sharing PDF: {0}
pt: Erro ao partilhar PDF: {0}

# Pdf_FolderNotFound
source: Folder Not Found
pt: Pasta não encontrada

# Pdf_FolderNotFoundMessage
source: Client folder not found. Create it?
pt: A pasta do cliente não foi encontrada. Deseja criar?

# Print_Error
source: Print Failed: {0}
pt: Falha ao imprimir: {0}

# Print_ViewAccessError
source: Could not access print view.
pt: Não foi possível aceder à vista de impressão.

# Print_StartError
source: Error starting print: {0}
pt: Erro ao iniciar impressão: {0}

# Feature_MacOSOnly
source: Feature available only on macOS.
pt: Funcionalidade disponível apenas em macOS.

# Feature_MacIOSOnly
source: Printing available only on macOS/iOS.
pt: Impressão disponível apenas em macOS/iOS.

# Products_LoadError
source: Failed to load products: {0}
pt: Falha ao carregar produtos: {0}

# ServicePage_Title
source: Services
pt: Serviços

# ServicePage_SearchPlaceholder
source: Search by no., client or status...
pt: Pesquisar por nº, cliente ou estado…

# ServicePage_NewService
source: New Service
pt: Novo Serviço

# ServicePage_CreatedLabel
source: Created: {0:dd/MM/yyyy}
pt: Criado: {0:dd/MM/yyyy}

# ServicePage_DeliveryLabel
source: Delivery: {0:dd/MM/yyyy}
pt: Entrega: {0:dd/MM/yyyy}

# ServicePage_ReceivedLabel
source: Received: {0:N2} €
pt: Recebido: {0:N2} €

# ServicePage_OwedLabel
source: Owed: {0:N2} €
pt: Deve: {0:N2} €

# ServicePage_EmptyTitle
source: No services to show
pt: Sem serviços para mostrar

# ServicePage_EmptyMessage
source: Check database connection or create a new service.
pt: Verifique a ligação à base de dados ou crie um novo serviço.

# Sync_FolderTitle
source: Folder Synchronization
pt: Sincronização de Pastas

# Sync_FolderMessage
source: Detected {0} clients without synchronized folders.\nDo you want to create the folder structure for them now?
pt: Detetados {0} clientes sem pastas sincronizadas.\nDeseja criar a estrutura de pastas para eles agora?

# Sync_Yes
source: Yes, Synchronize
pt: Sim, Sincronizar

# Sync_NotNow
source: Not Now
pt: Agora não

# Sync_ReportTitle
source: Report
pt: Relatório

# Sync_ReportMessage
source: Synchronization complete.\nSuccess: {0}\nErrors/Ignored: {1}
pt: Sincronização concluída.\nSucesso: {0}\nErros/Ignorados: {1}

# Sync_Starting
source: Starting synchronization...
pt: A iniciar sincronização...

# ClientsPage_VendorPrefix
source: Rep:
pt: Vend:

# ClientsPage_PreviousYear
source: Previous Year
pt: Ano Anterior

# ClientsPage_CurrentYear
source: Current Year
pt: Ano Atual

# Dashboard_Subtitle
source: Financial and sales analytics
pt: Analítica financeira e vendas

# Dashboard_CompareYear
source: Compare year {0}
pt: Comparar ano {0}

# Dashboard_Revenue
source: Revenue
pt: Receitas

# Dashboard_Expenses
source: Expenses
pt: Despesas

# Dashboard_Margin
source: Margin
pt: Margem

# Dashboard_Cash
source: Cash
pt: Caixa

# Dashboard_CashDetail_Compare
source: Compare prev year
pt: Compara ano-1

# Dashboard_CashDetail_Current
source: Receipts
pt: Recebimentos

# Dashboard_Chart_RevenueVsExpenses_Title
source: Revenue vs Expenses
pt: Receitas vs Despesas

# Dashboard_Chart_RevenueVsExpenses_Subtitle
source: Per month
pt: Por mês

# Dashboard_Chart_CashFlow_Title
source: Cash Flow
pt: Fluxo de Caixa

# Dashboard_Chart_CashFlow_Subtitle
source: Monthly inflows - outflows
pt: Entradas - saídas mensais

# Dashboard_Legend_Revenue
source: Revenue
pt: Receitas

# Dashboard_Legend_Expenses
source: Expenses
pt: Despesas

# Dashboard_Legend_Positive
source: Positive
pt: Positivo

# Dashboard_Legend_Negative
source: Negative
pt: Negativo

# Dashboard_TopClients_Title
source: Top Clients
pt: Top Clientes

# Dashboard_TopProducts_Title
source: Top Selling Products
pt: Produtos mais vendidos

# Dashboard_SellerSales_Title
source: Sales by Seller
pt: Vendas por Vendedor
